app/controllers/sample_controller.rb

  def index
    if request.post? then
      obj = Sample.new(
        :name => params['name'],
        :age =>  params['age'],
        :mail => params['mail'],
        :tel =>  params['tel']
      )
      obj.save
    end

    @title = "index Page"
    @datas=Sample.all
---
INSERT INTO "samples" ("name", "age", "mail", "tel", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "taro"], ["age", 22], ["mail", "aas@kks"], ["tel", "23394948"], ["created_at", "2015-07-06 07:42:07.251130"], ["updated_at", "2015-07-06 07:42:07.251130"]]
SELECT "samples".* FROM "samples"

  def show
    @title = "Show ID = " + params[:id]
    @result = Sample.find(params[:id])
---
SELECT  "samples".* FROM "samples" WHERE "samples"."id" = ? LIMIT 1  [["id", 2]]

  def update
    if request.post? then
      @title = "Update Id  Post= "
      #@result.name = params['name']
      #@result.age = params['age'].to_i
      #@result.tel = params['tel']
      #@result.mail = params['mail']
      #@result.save
      #redirect_to :action => "index"
      #@result = Sample.find(params[:id])
      @title = "Update Id POst= "
    else
      @result = Sample.find(params[:id])
---
SELECT  "samples".* FROM "samples" WHERE "samples"."id" = ? LIMIT 1  [["id", 3]]

  def delete
    obj = Sample.find(params[:id])
    obj.destroy
---
SELECT  "samples".* FROM "samples" WHERE "samples"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "samples" WHERE "samples"."id" = ?  [["id", 7]]